app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 19 LIMIT 1
---
            <%if params[:id].scan(/[a-zA-Z]/).size == 0%>
                <%found_user = User.find(params[:id].to_i)%>