app/views/gossips/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."active_user" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
                <input name="authenticity_token" type="hidden" value="<%= form_authenticity_token %>">
                <input name="user_id" type="hidden" value="<% User.where(active_user: true).first.id %>">