app/views/static/index.erb

        <div class="article">
            <%for n in Gossip.all do %>
                Titre du gossip : <%= n.title%><br>
                Utilisateur : <%= "#{n.user.first_name} #{n.user.last_name}" %><br>
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1