app/views/static/profil.erb

        <%if params[:name].scan(/[a-zA-Z]/).size == 0%>
            <%found_user = User.find(params[:name].to_i)%>
        <%else%>
            <%found_user = User.where(first_name: params[:name]).first %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."first_name" = 'Bryan' ORDER BY "users"."id" ASC LIMIT 1