app/controllers/gossips_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 21 ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ('UU', 'UUUUUUUUUU', '2025-10-07 15:21:16.307694', '2025-10-07 15:21:16.307694', 21) RETURNING "id"
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
    my_user = User.where(id: params['user_id'].to_i).first
    yeslife = Gossip.new(content: params['gossip_content'], user_id: my_user.id, title: params['gossip_title'])
    puts "##### on est dans le create"

    if yeslife.title.present? && yeslife.content.present? && yeslife.save #vert