app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."active_user" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
                <a class="nav-link" href="/gossips/new">Créer un potin</a>
                <a class="nav-link" href="/users/<%=User.where(active_user: true).first.id%>">Profil Utilisateur</a>